{
    "class_name": "Sequential",
    "config": [
        {
            "class_name": "Lambda",
            "config": {
                "arguments": {},
                "batch_input_shape": [
                    null,
                    66,
                    200,
                    3
                ],
                "function": [
                    "\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\btrain.py\u00da\b<lambda>h\u0000\u0000\u0000s\u0000\u0000\u0000\u0000",
                    null,
                    null
                ],
                "function_type": "lambda",
                "input_dtype": "float32",
                "name": "lambda_1",
                "output_shape": null,
                "output_shape_type": "raw",
                "trainable": true
            }
        },
        {
            "class_name": "Convolution2D",
            "config": {
                "W_constraint": null,
                "W_regularizer": null,
                "activation": "linear",
                "activity_regularizer": null,
                "b_constraint": null,
                "b_regularizer": null,
                "bias": true,
                "border_mode": "same",
                "dim_ordering": "tf",
                "init": "glorot_uniform",
                "name": "convolution2d_1",
                "nb_col": 8,
                "nb_filter": 16,
                "nb_row": 8,
                "subsample": [
                    4,
                    4
                ],
                "trainable": true
            }
        },
        {
            "class_name": "ELU",
            "config": {
                "alpha": 1.0,
                "name": "elu_1",
                "trainable": true
            }
        },
        {
            "class_name": "Convolution2D",
            "config": {
                "W_constraint": null,
                "W_regularizer": null,
                "activation": "linear",
                "activity_regularizer": null,
                "b_constraint": null,
                "b_regularizer": null,
                "bias": true,
                "border_mode": "same",
                "dim_ordering": "tf",
                "init": "glorot_uniform",
                "name": "convolution2d_2",
                "nb_col": 5,
                "nb_filter": 32,
                "nb_row": 5,
                "subsample": [
                    2,
                    2
                ],
                "trainable": true
            }
        },
        {
            "class_name": "ELU",
            "config": {
                "alpha": 1.0,
                "name": "elu_2",
                "trainable": true
            }
        },
        {
            "class_name": "Convolution2D",
            "config": {
                "W_constraint": null,
                "W_regularizer": null,
                "activation": "linear",
                "activity_regularizer": null,
                "b_constraint": null,
                "b_regularizer": null,
                "bias": true,
                "border_mode": "same",
                "dim_ordering": "tf",
                "init": "glorot_uniform",
                "name": "convolution2d_3",
                "nb_col": 5,
                "nb_filter": 64,
                "nb_row": 5,
                "subsample": [
                    2,
                    2
                ],
                "trainable": true
            }
        },
        {
            "class_name": "Flatten",
            "config": {
                "name": "flatten_1",
                "trainable": true
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_1",
                "p": 0.2,
                "trainable": true
            }
        },
        {
            "class_name": "ELU",
            "config": {
                "alpha": 1.0,
                "name": "elu_3",
                "trainable": true
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "W_constraint": null,
                "W_regularizer": null,
                "activation": "linear",
                "activity_regularizer": null,
                "b_constraint": null,
                "b_regularizer": null,
                "bias": true,
                "init": "glorot_uniform",
                "input_dim": null,
                "name": "dense_1",
                "output_dim": 512,
                "trainable": true
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_2",
                "p": 0.5,
                "trainable": true
            }
        },
        {
            "class_name": "ELU",
            "config": {
                "alpha": 1.0,
                "name": "elu_4",
                "trainable": true
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "W_constraint": null,
                "W_regularizer": null,
                "activation": "linear",
                "activity_regularizer": null,
                "b_constraint": null,
                "b_regularizer": null,
                "bias": true,
                "init": "glorot_uniform",
                "input_dim": null,
                "name": "dense_2",
                "output_dim": 1,
                "trainable": true
            }
        }
    ],
    "keras_version": "1.1.2"
}