{
    "keras_version": "1.1.2",
    "config": [
        {
            "class_name": "Lambda",
            "config": {
                "name": "lambda_1",
                "trainable": true,
                "output_shape_type": "raw",
                "output_shape": [
                    80,
                    320,
                    3
                ],
                "input_dtype": "float32",
                "batch_input_shape": [
                    null,
                    80,
                    320,
                    3
                ],
                "function": [
                    "\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u000fmodel_simple.py\u00da\b<lambda>\u0010\u0000\u0000\u0000s\u0000\u0000\u0000\u0000",
                    null,
                    null
                ],
                "function_type": "lambda",
                "arguments": {}
            }
        },
        {
            "class_name": "Convolution2D",
            "config": {
                "W_regularizer": null,
                "nb_col": 3,
                "b_constraint": null,
                "activation": "linear",
                "W_constraint": null,
                "batch_input_shape": [
                    null,
                    80,
                    320,
                    3
                ],
                "bias": true,
                "name": "Conv2D_1",
                "subsample": [
                    2,
                    2
                ],
                "activity_regularizer": null,
                "border_mode": "valid",
                "input_dtype": "float32",
                "init": "glorot_uniform",
                "b_regularizer": null,
                "dim_ordering": "tf",
                "nb_filter": 24,
                "nb_row": 3,
                "trainable": true
            }
        },
        {
            "class_name": "ELU",
            "config": {
                "name": "elu_1",
                "trainable": true,
                "alpha": 1.0
            }
        },
        {
            "class_name": "Flatten",
            "config": {
                "name": "Flatten",
                "trainable": true
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "W_regularizer": null,
                "input_dim": null,
                "b_regularizer": null,
                "b_constraint": null,
                "activation": "linear",
                "W_constraint": null,
                "bias": true,
                "name": "Output",
                "output_dim": 1,
                "activity_regularizer": null,
                "trainable": true,
                "init": "glorot_uniform"
            }
        }
    ],
    "class_name": "Sequential"
}