{
    "class_name": "Sequential",
    "config": [
        {
            "class_name": "Lambda",
            "config": {
                "arguments": {},
                "batch_input_shape": [
                    null,
                    66,
                    200,
                    3
                ],
                "function": [
                    "\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\btrain.py\u00da\b<lambda>)\u0000\u0000\u0000s\u0000\u0000\u0000\u0000",
                    null,
                    null
                ],
                "function_type": "lambda",
                "input_dtype": "float32",
                "name": "lambda_1",
                "output_shape": null,
                "output_shape_type": "raw",
                "trainable": true
            }
        },
        {
            "class_name": "Convolution2D",
            "config": {
                "W_constraint": null,
                "W_regularizer": null,
                "activation": "linear",
                "activity_regularizer": null,
                "b_constraint": null,
                "b_regularizer": null,
                "bias": true,
                "border_mode": "valid",
                "dim_ordering": "tf",
                "init": "glorot_uniform",
                "name": "convolution2d_1",
                "nb_col": 3,
                "nb_filter": 24,
                "nb_row": 3,
                "subsample": [
                    2,
                    2
                ],
                "trainable": true
            }
        },
        {
            "class_name": "ELU",
            "config": {
                "alpha": 1.0,
                "name": "elu_1",
                "trainable": true
            }
        },
        {
            "class_name": "Flatten",
            "config": {
                "name": "Flatten",
                "trainable": true
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "W_constraint": null,
                "W_regularizer": null,
                "activation": "linear",
                "activity_regularizer": null,
                "b_constraint": null,
                "b_regularizer": null,
                "bias": true,
                "init": "glorot_uniform",
                "input_dim": null,
                "name": "Output",
                "output_dim": 1,
                "trainable": true
            }
        }
    ],
    "keras_version": "1.1.2"
}